app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    @lists = List.all

INSERT INTO "lists" ("category", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["category", "packing"], ["created_at", "2018-01-30 19:49:35.949002"], ["updated_at", "2018-01-30 19:49:35.949002"]]
---
  def create
   @list = List.new(list_params)
    if @list.save

UPDATE "lists" SET "category" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["category", "packing"], ["updated_at", "2018-01-30 19:14:03.160240"], ["id", 1]]
---
  def update
    if @list.update(list_params)

DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 1]]
---
  def destroy
    @list.destroy

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_list
      @list = List.find(params[:id])