app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

  def create
    p 'hello'
    @subject = Subject.new(subject_params)
    @subject.list_id = params[:list_id]


    if @subject.save
---
INSERT INTO "subjects" ("name", "created_at", "updated_at", "list_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "alinea"], ["created_at", "2018-01-30 20:02:20.577518"], ["updated_at", "2018-01-30 20:02:20.577518"], ["list_id", 2]]

    def set_subject
      @subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]